Revit 2026 API

# SchemaCommonKeyword Property

---

The property labeled "Keyword" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string Keyword { get; }
```
```vb
Public Shared ReadOnly Property Keyword As String
	Get
```
```cpp
public:
static property String^ Keyword {
	String^ get ();
}
```
```fsharp
static member Keyword : string with get
```

#### Property Value

String

This property is of type "AssetPropertyString". Use ":" to add several keywords.

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace